Revit 2027 API
AddInCommandBinding.CanExecute Event
Occurs when the command associated with this AddInCommandBinding initiates a check to determine whether the command can be executed on the command target.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<CanExecuteEventArgs> CanExecute
Public Event CanExecute As EventHandler(Of CanExecuteEventArgs)
public:
 event EventHandler<CanExecuteEventArgs^>^ CanExecute {
	void add (EventHandler<CanExecuteEventArgs^>^ value);
	void remove (EventHandler<CanExecuteEventArgs^>^ value);
}
member CanExecute : IEvent<EventHandler<CanExecuteEventArgs>,
    CanExecuteEventArgs>
Value
EventHandler<CanExecuteEventArgs>
Remarks
 This callback will be called by Revit's user interface any time there is a contextual change. Therefore, the callback must be fast and is not permitted to be blocking in any way.
See Also
Reference
AddInCommandBinding Class
Autodesk.Revit.UI Namespace